[
    {
    "mal_id": 166439,
    "url": "https://myanimelist.net/character/166439/Marin_Kitagawa",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/14/457312.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/14/457312.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/14/457312t.webp"
    }
    },
    "name": "Marin Kitagawa",
    "name_kanji": "喜多川 海夢",
    "nicknames": [],
    "favorites": 20817,
    "about": "Age: 15\nBirthday: March 5\nHeight (In cm): 164\n\nMarin Kitagawa is a popular and beautiful high school girl in Gojo's class. She is very interested in cosplay and has tried to make her own, but without much success. By chance, she discovers Gojo can sew and the two bond over their mutual enthusiasm for their respective hobbies. \n\nShe's a dreadful cook, with a bubbly personality. Her favorite cosplayer is Juju-san, and she'll watch anime and play video games for fun.\nKitagawa-san is very emotionally mature, down to earth and respectful."
    },
    {
    "mal_id": 160603,
    "url": "https://myanimelist.net/character/160603/Miku_Nakano",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/366718.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/366718.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/11/366718t.webp"
    }
    },
    "name": "Miku Nakano",
    "name_kanji": "中野 三玖",
    "nicknames": [],
    "favorites": 20607,
    "about": "Age: 17-18\nBirthday: May 5\nHeight: 164cm\nWeight: 49 kg\nBlood type: A\n\nMiku Nakano is the third sister of the Nakano Quintuplets. She is a silent and reserved girl. Miku tends to have pessimistic attitude and little confidence regarding herself.\n\n\n(Source: Gotoubun no Hanayome Wiki, Queentuplets website)"
    },
    {
    "mal_id": 30,
    "url": "https://myanimelist.net/character/30/Gon_Freecss",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/174517.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/174517.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/11/174517t.webp"
    }
    },
    "name": "Gon Freecss",
    "name_kanji": "ゴン＝フリークス",
    "nicknames": [],
    "favorites": 20565,
    "about": "Age: 12 (beginning), 14-15 (current)\nBirthday: May 5\nHeight: 154 cm\nWeight: 49 kg\nEye Color: Brown\nBlood type: B\nOccupation: Hunter\nNen type: Enhancement\nAbilities: \n\nGon Freecss (ゴン゠フリークス, Gon Furīkusu) is a Rookie Hunter and the son of Ging Freecss. Finding his father is Gon's motivation in becoming a Hunter. He has been the main protagonist for most of the series.\n\nGon wants to become a Hunter because he wishes to find out the depths of an occupation that would cause a father to choose the profession over being with his own son.\n\nGon is an athletic, rustic, and friendly boy who is searching for adventure. Also, he is not very good at math. However, having spent a lot of time in the woods as a child, he is very good with animals. Simultaneously, his flaws lie in his temper and impulsive nature. Gon sometimes fails to think things through and such actions lead to him suffering. Though possessing talent far beyond the norm for his age, anytime his abilities are challenged, he feels as if he has to prove his antagonist wrong.\n\n\n\nBackground: \n\n\nTimeline:\n\n\n\n\n\n\n\n\n\n\n\n\n(Source: Hunter x Hunter Wiki)"
    },
    {
    "mal_id": 458,
    "url": "https://myanimelist.net/character/458/Revy",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/10/78871.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/10/78871.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/10/78871t.webp"
    }
    },
    "name": "Revy",
    "name_kanji": "レヴィ",
    "nicknames": [
    "Two Hands",
    "Rebecca"
    ],
    "favorites": 20527,
    "about": "Revy (レヴィ), sometimes referred by her full name Rebecca (レヴェッカ), is the female protagonist of the series. She does most of the fighting for the Lagoon Company. Very little is revealed about her past, although portions can be pieced together through the series. Revy is a Chinese-American born and raised in Chinatown, Manhattan, near Mott Street, spending most of her youth as a thief and murderer. Flashbacks throughout the series reveal that Revy may have honed her skills with firearms by shooting at cans, and that her first murder may have involved shooting an unknown man while using a pillow. It is unknown whether the pillow was used to suppress the noise or to help avoid looking at her first victim.\n\n\nRevy is very competitive, easily bored, and extremely ill-tempered. Unlike Rock, she is undiplomatic, believing in the use of brute force and coercion to get her way. In contrast to this, she's revealed to be highly ticklish.\n\nRevy is a merciless and sadistic killer, without a conscience, who will kill anyone at the slightest provocation, even unarmed civilians (as seen in episode 6). Dutch once made reference to University of Texas shooter Charles Whitman in describing Revy after she slaughtered the crew of the Neo-Nazis' boat after a previous conversation with Rock brought up some unpleasant memories, resulting in an internal fit of rage - she even threatened Rock with death if he ever questions or tampers with her way of life. Of all the characters in the series, Revy uses the most foul language. She takes maniacal glee in killing anyone and everyone. She is also a heavy smoker and drinker.\n\nShe has a changing but volatile attitude towards Rock; though she respects him later in the series, she is mostly hostile towards him. She shot Rock at point blank range, but he moved her gun at the last second, during a confrontation in episode 7, and in episode 1 emptied most of a magazine in his direction while arguing with Dutch about their hostage. However, she does have a tendency to save Rock from critical situations, and later on she admits to considering Rock as family to Balalaika. It is possible that she has an attraction to Rock, based on her reactions to Eda's teasing, which appear to be jealousy.\n\nAccording to CIA agents on Basilan Island, towards the end of episode 12, Revy is still notorious in the NYPD, particularly at the 27th Precinct. Since the 27th Precinct does not exist in real-life New York City, this throwaway reference may - or may not - indicate an odd connection to Dick Wolf's Law and Order franchise. This is further suggested in a later episode, when Revy specifically mentions the series.\n\nRevy is one of the deadliest fighters in the series, whose skill with firearms and ability to dodge bullets is almost superhuman and unparallelel. There are only a few other characters, such as Roberta and Ginji, that can hold their ground against her in combat.\n\nHer weapons of choice are a pair of modified Beretta 92FS's; which are made out of stainless steel and had their barrels extended from 4.9\" to 5.9\" each (the 5.9\" is the combat MOD barrel) and also adapted for silencers. They are engraved with \"9mm Sword Cutlass\" on both sides, as well as the Jolly Roger of the infamous pirate Calico Jack (which is also inlaid into the ivory grips), and a manufacture inscription in Thai. Due to her ambidextrous marksmanship skills, she is nicknamed \"Two Hand\" by the denizens of Roanapur. However, Revy has been seen using a variety of other firearms.\n\nConstantly living on the edge of life, Revy has developed a rather bleak, almost nihilistic outlook on life, relying only on her own power, skills, and money. She does not believe in God or emotions. However, she seems to respect and trust her companions.\n\n(Source: Wikipedia)"
    },
    {
    "mal_id": 131549,
    "url": "https://myanimelist.net/character/131549/Rimuru_Tempest",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/4/495795.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/4/495795.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/4/495795t.webp"
    }
    },
    "name": "Rimuru Tempest",
    "name_kanji": "リムル＝テンペスト",
    "nicknames": [
    "Mikami Satoru"
    ],
    "favorites": 20353,
    "about": "Race: Human (past life) → Slime → Demon Slime \nAge: 37 (past life) → 2 (anime/manga), 3 (light novel)\nSex: Male (past life) → Sexless\nTitle: Ruler of Monsters, Jura-Tempest Federation Chancellor, \nDivine protection: Storm Crest\nMagic: Element Magic archive, Spirit Magic archive, Greater Spirit summoning, Greater Demon summoning, \nAbility:\nSpecies Skill - Universal Sense, Universal Thread, Universal Shapeshift, Infinite Regeneration, Demon Lord Haki, Enhanced Replication\nUltimate Skill - Wisdom King Raphael, King of Gluttony Beelzebuth, Covenant King Uriel, Storm King Veldora, \nResistance: Physical Attack Nullification, Natural Effects Nullification, Abnormal Condition Nullification, Spiritual/Mental Attack Resistance, Holy-Demonic Attack Resistance\n\nThe main protagonist of the series and Founder as well as Chancellor and King of the monster nation known as the Jura-Tempest Federation. Originally Mikami Satoru, a 37-year-old general contractor, he was stabbed by a passing robber while protecting one of his co-workers and reincarnated in a new world as a slime, one of the lowest monsters on the food chain.\n\nIn spite of the situations he finds himself in, he often tends to be very easygoing, yet calculating and cautious. A pacifist at heart, he tries to avoid casualties and save people if possible and wishes to maintain good relations with humans.\n\n\n(Source: Tensei Shitara Slime Datta Ken Wiki, edited)"
    },
    {
    "mal_id": 148984,
    "url": "https://myanimelist.net/character/148984/Senkuu",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/380950.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/380950.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/8/380950t.webp"
    }
    },
    "name": "Senkuu",
    "name_kanji": "千空",
    "nicknames": [],
    "favorites": 20154,
    "about": "Birthday: January 4, 2004\nHeight: 171 cm (188cm considering his hair)\nWeight: 61 kg\nHair Color:  White with Dark Green Tips\nEye Color: Red\nBlood Type: AB\n\nSenkuu is a straight-forward, confident and highly logical individual who can come off as arrogant. Even so, his borderline-overconfidence does not cloud his judgment, as he is often backed up by his superior and vast knowledge of science. Senkuu never belittles those who are less knowledgeable than him. Rather, he encourages and inspires everyone around him to do better. Because of his charisma and caring nature, people tend to gather around him, both allies and supporters alike. However, he can act over-the-top at times when he is excited over a creation or at the discovery of something new.\n\n(Source: Dr. Stone Wiki)"
    },
    {
    "mal_id": 70069,
    "url": "https://myanimelist.net/character/70069/Kurumi_Tokisaki",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/310255.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/310255.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/8/310255t.webp"
    }
    },
    "name": "Kurumi Tokisaki",
    "name_kanji": "時崎 狂三",
    "nicknames": [
    "Nightmare",
    "Worst Spirit",
    "Spirit of Time"
    ],
    "favorites": 20131,
    "about": "Birthday: June 10\nHeight: 157 cm (5'2\")\nCode name: Nightmare\nSpirit number: 3\nSpecies: Spirit\nAngel: Zafkiel\nWeapon: Clock type\nAstral Dress: Elohim\nAffiliation: Raizen High School (temporary)\nHobbies: Killing people, teasing Shidou\nLikes: Weaponry, sweets, kitties\nDislikes: Humans, AST \nStrength: 109\nConsistency: 80\nSpiritual power: 220\nAgility: 103\nIntelligence: 201\nRank: S-Class Spirit\nFamous quote: \"I want his power. I want to make him mine and become one with him.\"\n\nKurumi Tokisaki is the main antagonist in the series. She is the third Spirit to be encountered in the series and is the most dangerous and lethal Spirit. She is heavily obsessed with Shidou and has the ability to manipulate time. Her codename is Nightmare. She has a split personality: that of a gentle, mysterious high school girl with a slow talking pattern, and that of a psychopathic killer. Kurumi is very aggressive in her actions which makes it harder for Shidou to capture her.\n\nKurumi can be described a person whose personality is hard to read, possessing a well-polished dislike of humanity that borders on mistrust, something she shared with many Spirits in their debut. She is a skilled actress, capable of putting on the façade of an innocent, curious young girl when she needs to, shown when she registered as a student at the Raizen High School, even speaking in a very polite manner; however, under that mask lies a psychotic woman, prone to fits of insane laughter that possesses no regard for human life, regarding them as a food source to restore her own time, and thus, a disposable commodity. There is a twisted justice behind her methods, however, as the people that she brutally murdered were would-be rapists and animal abusers.\nIn hindsight, Kurumi possesses some degree of innocence that her psychotic behavior have not entirely ruined; she has a soft spot for small animals and other creatures. She once slaughtered four humans not because she needed to replenish her time, but because they were trying to kill a kitten, this is the closest to a humanizing emotion that she has.\n\nMana reported that Kurumi is the most dangerous spirit known, who has personally killed over 10,000 people which does not include the spacequake's victims within that statistics. Kurumi  used unstated and unexplained methods to personally transfer into Shidou Itsuka's high school and classroom so she can get closer to him. Her purposes and reasons in this transfer are simple; consume Shidou Itsuka, in doing so gain their memories, goals, fears and obsessions. In some non-canon stories, the clone Shido seduced shows some \"independent\" attitude, almost rebellious, and openly acts lovey-dovey with Shido, which causes troubles to the \"main\" Kurumi and even leads to confrontation with her.\n\n\n\nKurumi has the ability to manipulate the 4th dimension, mainly time, but her main power is associated with controlling shadows. Shadow is her primary power while Time is her secondary power in terms of usage. Combined with the power of time, she can create a clone with all her experiences, memories, abilities, etc. These clones however are shadows of her past selves who contain feelings the current Kurumi no longer possesses, Kurumi will kill these clones if they are swayed away from her goals.\n\nThese clones are less powerful than Kurumi herself as she has mentioned in the last chapter of volume 3 and in the epilogue of volume 4. She can form a single clone by shooting herself with Zafkiel or bring out all of her clones at once from a pool of shadows which she also uses to draw them all back in and all the time they've collected. She can also call her clones partially through small fields of shadows, most often to hold someone in place and prevent them from moving.\n\nTo activate any power she needs, she first needs to call her Angel (regardless of whether or not the Angel has been summoned already or not), and to position both of her guns just like a clock: The musket on 12 and the flintlock points at the number of the bullet. Next she needs to shoot the bullet at the target with the hand gun. In case she needs it for herself, she will be required to shoot it at her head.\n\nShe also has the ability to call and dismiss spacequakes at will, as shown in the series while she confronts Shidou on the school's rooftop.\n\n(Source: Wikipedia, DAL Wiki)"
    },
    {
    "mal_id": 161471,
    "url": "https://myanimelist.net/character/161471/Itsuki_Nakano",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/437010.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/437010.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/5/437010t.webp"
    }
    },
    "name": "Itsuki Nakano",
    "name_kanji": "中野 五月",
    "nicknames": [],
    "favorites": 19828,
    "about": "Age: 17-18\nBirthday: May 5\nHeight: 159-165 cm\nWeight: 55.6 kg\nBlood type: A\n\nItsuki Nakano is the fifth sister of the Nakano Quintuplets. She is attributed as the \"first girl\" of the series. Itsuki is serious and diligent, yet she's also a glutton and crybaby.\n\nItsuki is a serious girl, usually getting up early compared to her sisters. She also has good manners, to the point where she cares a lot about manners. She has never been late or skipped a class, and always speaks polite language.\n\nItsuki has been seen to be a girl who holds a grudge, this is shown when she rejects Fuutarou Uesugi's teaching, in part, due to their earlier dispute. She is also someone who cannot be honest with herself and has a hard time being more direct. Both of these qualities often make her fight alone. Itsuki is often too precise in the timing of food cooking.\n\nItsuki sometimes tends to be a crybaby, whether it's due to unfavorable situations, scary things, or her stubborn self.\n\nItsuki has a large appetite and is mainly seen eating throughout the series. It seems like she doesn't mind treating her sisters unfairly when it comes to things related to food. When Itsuki proposes to share their cakes, Ichika suspects that his real goal is to try all the flavors. Itsuki worries about Fuutarou, but it's really because he's hungry.\n\nAccording to Ichika, Fuutarou has to be firm to deal with Nino and kind to deal with Itsuki.\n\n(Source: Gotoubun no Hanayome Wiki)"
    },
    {
    "mal_id": 46494,
    "url": "https://myanimelist.net/character/46494/Armin_Arlert",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/220267.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/220267.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/8/220267t.webp"
    }
    },
    "name": "Armin Arlert",
    "name_kanji": "アルミン・アルレルト",
    "nicknames": [],
    "favorites": 19403,
    "about": "Age: 15\n\nBirthday: November 3\nHeight: 163 cm (5'4\")\nWeight: 55 kg (121 lbs)\nPosition: 104th Trainees Squad, Scouting Legion\nGraduation Rank: Outside the top 10\n\nArmin Arlert is Eren's best friend. He is physically weak, but emotionally strong. Even though he lacks in actual combat skills, Armin is a genius in theoretical courses and can make plans even under extreme pressure. Even so, Armin keeps on thinking that he is weak. He himself does not notice the things he does for Eren and Mikasa and believes himself to be completely incompetent and hates himself for having to rely on Eren and Mikasa.\n\n(Source: Wikipedia, edited)\n\nNote: Armin Arlert is the official English translation by Kodansha."
    },
    {
    "mal_id": 65643,
    "url": "https://myanimelist.net/character/65643/Koro-sensei",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/9/277325.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/9/277325.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/9/277325t.webp"
    }
    },
    "name": "Koro-sensei",
    "name_kanji": "殺せんせー",
    "nicknames": [],
    "favorites": 19225,
    "about": "Koro-sensei is a teacher for class 3-E of Kunugigaoka Junior High School and the main antihero of Ansatsu Kyoushitsu. He was responsible for carving out a large chunk of the moon to become a permanent crescent moon and plans to destroy the earth after teaching class 3-E for a year.\n\nHis name comes from Korosenai (殺せない) means \"cannot be killed\" and sensei, means teacher. Literally, his name means unkillable teacher."
    },
    {
    "mal_id": 117221,
    "url": "https://myanimelist.net/character/117221/Kazuma_Satou",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/301302.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/8/301302.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/8/301302t.webp"
    }
    },
    "name": "Kazuma Satou",
    "name_kanji": "佐藤 和真",
    "nicknames": [],
    "favorites": 19220,
    "about": "Age: 17 Height: 165 cm\n\nThe main protagonist of KonoSuba. A sixteen-year-old Japanese teenager who became a game-obsessed shut-in after having his heart broken over his childhood friend during middle school. He is sent to the parallel reality after dying from acute stress reaction, forcing Aqua to come with him after she irritates him with her attitude. Kazuma is classed as an Adventurer which, despite being the lowest ranked class, allows him to learn various skills from other classes, albeit at an increased cost. With his ability, Kazuma learns basic skills such as stealing, archery, monster detection, and basic magic.\n\n(Source: Wikipedia)"
    },
    {
    "mal_id": 13767,
    "url": "https://myanimelist.net/character/13767/Law_Trafalgar",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/10/258757.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/10/258757.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/10/258757t.webp"
    }
    },
    "name": "Law Trafalgar",
    "name_kanji": "トラファルガー・ロー",
    "nicknames": [
    "Surgeon of Death"
    ],
    "favorites": 19043,
    "about": "Age: 24; 26\nBirthday: October 6\nAffiliations: Heart Pirates, \nDevil Fruit:\nType: Paramecia\nBounty: \nHeight: 191 cm (6'3\")\n\nTrafalgar Law is the captain of the Heart pirates, a pirate crew from the North Blue. He is one of eleven pirates who have been referred to as \"The Eleven Supernovas\" on Sabaody Archipelago whose bounties are higher than  100,000,000 when the Straw Hats arrive in the place.\n\nLaw is a slim and tall man wearing a black-sleeved yellow shirt with his Jolly Roger on it. He has many tattoos on his arms, as well as a pair of small earrings on both ears. On his left hand in particular are the letters D, E, A, T, and H tattooed on each of his fingers. The word formed from this letters is \"DEATH.\"\n\nLaw also carries along a nodachi with which he uses with his Devil Fruit powers. It is sword with a scabbard decorated with crosses from the opening to the bottom.\n\nLaw is an extremely laid-back character, who is nearly always seen smiling (although not with a huge grin, like fellow Supernova Urouge). He also has a more reckless attitude when faced against other pirates that the World Government has labeled as a higher threat: For example, he casually asked X. Drake how many people he had slain in his very first appearance, and had no qualms about flipping his middle finger at Eustass Kid, the most wanted Supernova on the Archipelago (even smiling defiantly when doing so). However, he hates being ordered around. He is also unfailingly polite, usually referring to others as \"Mr\", and appears to be honorable enough to refuse taking credit that is due to others."
    },
    {
    "mal_id": 140810,
    "url": "https://myanimelist.net/character/140810/Chika_Fujiwara",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/2/371542.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/2/371542.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/2/371542t.webp"
    }
    },
    "name": "Chika Fujiwara",
    "name_kanji": "藤原 千花",
    "nicknames": [],
    "favorites": 18891,
    "about": "The secretary of the Shuchiin Academy student council. She's been friends with Shinomiya since middle school. She's ditzy and likes to gossip, and often throws a wrench in Shinomiya and Shirogane's plans due to her unpredictability. Even so, she's quite a bit more well-adjusted than her fellow student council members and sometimes takes it upon herself to teach them how to overcome their shortcomings."
    },
    {
    "mal_id": 170733,
    "url": "https://myanimelist.net/character/170733/Power",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/7/494969.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/7/494969.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/7/494969t.webp"
    }
    },
    "name": "Power",
    "name_kanji": "パワー",
    "nicknames": [
    "Blood Devil"
    ],
    "favorites": 18846,
    "about": "Power is a fiend and Public Safety Devil Hunter, part of Makima's squad. She's a work partner and good friend with Denji. They share an apartment alongside Aki Hayakawa. She lacks manners and often lies to avoid punishment. She's very fond of her pet cat Nyako to the point she was willing to sacrifice Denji's life to save Nyako who had been captured by a bat demon.\n\n(Source: Chainsaw Man Wiki)"
    },
    {
    "mal_id": 14523,
    "url": "https://myanimelist.net/character/14523/Takumi_Usui",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/9/282968.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/9/282968.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/9/282968t.webp"
    }
    },
    "name": "Takumi Usui",
    "name_kanji": "碓氷 拓海",
    "nicknames": [
    "Perverted Alien"
    ],
    "favorites": 18835,
    "about": "Age: 17\nClass: 2-2\nBirthdate: April 27\nHeight: 186 cm\nWeight:  Unknown\nBlood type: O\nSchool: Seika High School\nSpecial skill: Everything he does\nFavorite thing: Observing Misaki work\nFavorite food: Porridge, Misa-chan's omelet rice and anything else she makes\nFavorite word: Ayuzawa Misaki\n\nOne of the most popular boys at Seika High, Usui appears to take little interest in anything and prefers to observe things as they unfold, though proves to be extraordinarily talented in numerous areas. He develops an interest in Misaki and is the first to learn she is working at a maid café, but chooses to keep her secret and soon falls in love with her. While she dismisses his behavior simply as harassment and teasing (but claims he just wanted to see her \"interesting expressions\"), he continues to watch over and protect her no matter what it takes like injuring himself in the process, as well as offering insightful advice on how to deal with the boys at Seika effectively and fairly. He appears to be the only male student at school that Misaki is willing to speak to as an equal. Little is known about Usui's background and he is reluctant to speak about it, though he reveals a willingness to tell Misaki. He has an older brother and lives alone in an apartment."
    },
    {
    "mal_id": 61,
    "url": "https://myanimelist.net/character/61/Robin_Nico",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/13/136773.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/13/136773.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/13/136773t.webp"
    }
    },
    "name": "Robin Nico",
    "name_kanji": "ニコ・ロビン",
    "nicknames": [
    "Devil Child",
    "Miss All Sunday"
    ],
    "favorites": 18781,
    "about": "Age: 28; 30\nBirthdate: February 6, Aquarius\nHeight: 188cm (6'2\") \nSizes: 99 - 59 - 89\nAffiliation: Straw Hat Pirates (previously; Baroque Works)\nPosition: Archaeologist\nDevil Fruit: Hana Hana no Mi (Flower Flower Fruit)\nType: Paramecia\nBounty: \nRobin is the seventh member of Straw Hat's Crew. She had a bounty of 79 million beri (One Piece currency)  since she was eight years old, during an incident in which she supposedly destroyed six Buster Call ships through the use of the powers she gained by the eating the Hana Hana no Mi (Flower Flower or Blooming Blooming Fruit). The fruit's power enables her to conjure up multiple replicas of her body parts (most often her arms) upon any surface she is able to see making her very powerful and dexterous as a result. \n\nRobin joined the Straw Hat Pirates after Luffy saved her life, or (how she states it) Luffy forced her to live when she wanted to die. To atone for his crime, Robin demands that Luffy allow her to join his crew, to which he complies leaving every other crew member except Sanji in shock. Although feared at first, she is quickly accepted and viewed as a comrade by the crew.\n\nRobin is actually an archaeologist of talent, and despises anyone who thoughtlessly damages any piece of history. The World Government fears her because she can decipher Poneglyphs (stones marked with glyphs from an ancient language), which contain details capable of reviving ancient weapons that have the power to destroy the world. In reality, Robin has stated that she does not care about ancient weapons, and that her dream is to find the True History written on the Rio Poneglyph.\n\nRobin is a mysterious and serious person who appears quiet and reclusive, and the wisest in the Straw Hat's Crew. She was thought by those around her to be cold and mean, but it was proven that she is actually a kind person who always thinks before she acts. She often only speaks when something interesting or important has happened. She loves to study history, and the comfort and freedom to study and read. She is also quick to point out gross or realistically morbid facts, often creeping out Nami or Usopp. Robin is the wisest and most sensible member of the crew. She has a vast knowledge of the seas and the world, and usually keeps her head during surprising situations, allowing her to logically analyze the situation without losing her cool. This trait makes her different from the other Straw Hats, who often comically react melodramatically to unexpected happenings and hold irrational ideas and conclusions. Despite her attempts to keep herself distant, Robin has fallen for her new friends, and has taken the role of the distant den mother."
    },
    {
    "mal_id": 65865,
    "url": "https://myanimelist.net/character/65865/Rikka_Takanashi",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/2/257273.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/2/257273.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/2/257273t.webp"
    }
    },
    "name": "Rikka Takanashi",
    "name_kanji": "小鳥遊 六花",
    "nicknames": [
    "Wielder of the Wicked Eye",
    "Master"
    ],
    "favorites": 18726,
    "about": "Birthday: June 12\nZodiac sign: Gemini\n\nThe main heroine of the story. She is an active Chuunibyou, who still has the syndrome. Her delusional syndrome involves her right eye, which she calls her \"Wicked Eye,\" in which according to her it wields darkness tamed by the power of a pure heart. In actuality, her so-called \"Wicked Eye\" is nothing more than a colored contact lens which she conceals underneath an eye-patch. Despite being quite attached to Yuuta, she is cautious of strangers and adapts a battle pose whenever she meets someone for the first time. She is also rather clumsy, often tripping over and forgetting things. She also doesn't have many friends, as shown that in her mobile phone, she only has Dekomori Sanae and her older sister Touka as contacts.\n\n\n\n(Source: Wikipedia)"
    },
    {
    "mal_id": 50389,
    "url": "https://myanimelist.net/character/50389/Rias_Gremory",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/150011.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/150011.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/5/150011t.webp"
    }
    },
    "name": "Rias Gremory",
    "name_kanji": "リアス・グレモリー",
    "nicknames": [
    "Buchou (President)",
    "Crimson-Haired Ruin Princess",
    "Princess of Destruction",
    "Switch Princess",
    "Oppai Ba"
    ],
    "favorites": 18708,
    "about": "Birthday: April 9th\nAge: (Volume 1-22), 19 (Volume 22-Present)\nHeight: 172 cm (5'8\")\nWeight: 58 kg (128 lbs)\nBWH: 99/58/90\nEye Color: Blue, Blue-Green (Season 1-3)\nRank: High-class Devil (Volume 1 - True Volume 4), Ultimate-class Devil (True Volume 4 - Present)\nRole: King\nRace: Pure-Blooded Devil\nFirst Appearance: Volume 1\nAffiliations:\n\n\nRias is a very kind and compassionate optimist, especially to her servants and people close to her. She gets angry and violent whenever people insult her or her peerage, showing a fiery side to her. \n\nShe is proud of her family's name, but she does not like being seen as Rias of the Gremory Family. The reason for her living in the human world (as revealed in Volume 2 of the novels) is because there, everyone sees her as Rias, not as a Devil or as the Crimson-Haired Ruin Princess. Due to this and the fact that the only men who showed interest in her were interested in her due to being the Heiress of the House of Gremory, Rias soured on the idea of finding a lover, until meeting and falling in love with Issei. According to Akeno, Rias originally said that all men looked the same to her as Rias said that Issei is the only exception due to her thinking of him as cute.\n\nShe thinks of Issei as a special person and always gets jealous when girls are around him, becoming a totally different person when she sees him and other girls together, or when it comes to training. Despite her mature stature like a woman, Rias tends to act her true age and becomes frustrated whenever girls flirt with Issei. While Rias is usually calm and mature in most situations, she loses her mature aura and presence when she sees any girl (especially Akeno) flirting with or seducing Issei.\n\nShe enjoys teasing Issei and Asia (from Volume 3 of the novels onward), but at the same time makes it clear (to Asia or any girl) that Issei is hers, and she does not want to share him at all (It is revealed in Volume 3 of the novels that the Gremory Family and their servants are beings with extraordinary affection among the Devils, so Rias is no exception). She has no problem with showing Issei her breasts or sleeping naked with him (which she always does according to her and she claims she can't sleep without being nude or without Issei). Despite being seductive like Akeno, both of the girls are still innocent to love, as both of them become their age whenever around Issei or on a date with him.\n\nAfter becoming Issei's girlfriend, Rias begins to show more confidence in her relationship with Issei and is no longer jealous or angry when Issei is with other girls like she previously was, even accepting Issei's dream of having a harem and letting the girls have dates with him. However, Rias still shows some signs of jealousy such as when Issei doesn't spend enough time with her, but still believes in him and loves him. Due to being Issei's official girlfriend and later fiancée, the other girls acknowledge her as the \"Legal Wife\" as she manages the other women who are in love with Issei. According to Ravel, the burden of Rias as the \"Legal Wife\" is greater than the burden of Issei as she has to manage the girls maidenly feelings towards Issei and balance out Issei's feelings towards each of his lovers/brides. Like Akeno, Rias shows a sign of dependence toward Issei (possibly lesser than the former) as Rias will lose her will to fight and lead. She developed an instinct when Issei is with an unknown woman or other girls tried to seduce him before her she immediately rush to him quickly.\n\nShe holds her older brother, Sirzechs, in high regard (despite her older brother's antics of being a siscon) because she deeply cares for him. When she was a child, she was entirely dependent on him and held him in admiration, while also feeling inferior to him at the same time.\n\nRias loves participating in Rating Games, as she dreams of becoming the Rating Game champion by defeating the current Rating Game champion; Diehauser Belial, with the help of her peerage. While Rias is a powerful devil in her own right, being much stronger than average High-class Devils and according to Azazel, being able to become a Ultimate-class Devil just on the virtue on her talent alone, Rias suffers a bit of an inferiority complex when she compares herself to her fellow Rookies Four colleagues, as she feels inferior to Sona as a strategist and that she is far weaker in power than Sairaorg. However, according to Riser and Azazel, Rias has a talent for finding and recruiting talented individuals for her peerage, inspiring great loyalty and growing stronger with them as seen in her meeting with Issei. \n\n\n\nRias is competitive and hates to lose, especially after losing her first Rating Game against Riser as she strives to always win, whether it is in sports or Rating Games.\n\nDue to being spoiled by her father Zeoticus and her brother Sirzechs from an early age, she has a somewhat impatient and selfish personality and because of her bad money spending habit, her mother Venelana and her sister-in-law Grayfia often scold her for her frivolous spending, as her mother reconsidered the amount of money she is allowed as allowance.\n\nEarly in her childhood, she developed an instinctive fear and hatred of camels due to being hit by a camel after making fun of it, as the fear is great enough that the residents of the Gremory territory constantly keep camels away from her despite the Gremory's association with camels in the Ars Goetia.\n\nDue to being taught about Japan from Souji Okita, Rias has developed an obsession with Japan, buying various Japanese souvenirs and being ecstatic while visiting Kyoto during her school field trip, though she became pouty and stomped at the train station due to being unable to fully explore Kyoto. \n\nPowers &amp; Abilities\n\n\n\n\n\n\n\nEquipment\n\n\n\n\n(Source: High School DxD Wiki)"
    },
    {
    "mal_id": 5189,
    "url": "https://myanimelist.net/character/5189/Erza_Scarlet",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/12/492254.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/12/492254.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/12/492254t.webp"
    }
    },
    "name": "Erza Scarlet",
    "name_kanji": "エルザ・スカーレット",
    "nicknames": [
    "Titania"
    ],
    "favorites": 18604,
    "about": "Age: 19\nHair: Scarlet\nEyes: Brown \nMagic and Abilities: Requip (also known as Ex-quip is a Caster Magic and a type of Spatial Magic related to the summoning of various types of equipment.)\n\nErza Scarlet is a S-class mage of the Fairy Tail Guild, the strongest still active female, and one of the main female protagonists in Team Natsu.\n\nErza, is a tall, beautiful young woman with long red hair, and brown eyes. She is almost always wearing an armored suit, made by Heart Kreuz. However, thanks to her requip magic, she can wear many magic armors, and can even requip swim suits, and clothes for recreational purposes. Her member stamp is on her left shoulder. She wears a standard medieval armor, but has a number of other themed armors such as Flame (or Lightning) Empress, which absorb the respected magic type, Adamantium,  Samurai-style and more.\n\nErza is a very strict person, often criticizing the bad behavior and habits of the other guild members, causing most them to apologize for fear that they might invoke her wrath. She is also impatient, liking people who answer her questions quickly as seen when she promptly knocks out anyone who doesn't answer her questions (despite them not knowing anything). Also, Erza has a problem where she apparently sees everyone as guild members (best seen when she asks civilians to take things places during a mission). However, she has a great sense of justice. Despite being a very strict person, she seems to have a clumsy side to her as seen during the Galuna arc when she fell into a pit hole.\n\nLike most Fairy Tail members, she shows great loyalty and dedication to Makarov and the guild. She pushed herself past her limit in the war against the Phantom Lord Guild, fighting against its many powerful members. She also became the temporary leader when Makarov had to be treated because of his scattered magic.\n\nAlthough it hasn't been fully explored, it is implied that Natsu Dragneel, Erza and Gray Fullbuster are all very close to each other. While staying over at Lucy's house, Erza revealed that the three of them used to take showers together. It is later revealed that Erza, Natsu, and Gray have all been part of Fairy Tail ever since they were children.\n\n\n\n(Source: Wikipedia)"
    },
    {
    "mal_id": 913,
    "url": "https://myanimelist.net/character/913/Vegeta",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/14/86185.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/14/86185.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/14/86185t.webp"
    }
    },
    "name": "Vegeta",
    "name_kanji": "ベジータ",
    "nicknames": [
    "Prince of All Saiyans"
    ],
    "favorites": 18509,
    "about": "Race: Saiyan\nBirth date: 732 Age\nHeight: 5' 5\"\nWeight: 126 lbs\nHobby: Training\nFavorite food: All types of food\nFavorite vehicle: Space pod\nKnown family: King Vegeta (father), Tarble (brother), Bulma (wife), Trunks (son), Bra [Bulla] (daughter)\n\nVegeta is a fictional character from the manga series Dragon Ball, created by Akira Toriyama.\n\nAlong with Goku, Gohan and Piccolo, he is one of the most prominent characters in the series, originally starting out as a villain before becoming a mainstay hero.\n\nVegeta starts out haughty, arrogant, self-entitled and ruthless as the prince of Saiyans. His royal status caused him to develop an inflated sense of superiority and he holds himself above most, if not all people he encounters. Regal, egotistical and full of pride, Vegeta was once a ruthless, cold-blooded warrior and outright killer. However, as the story unfolds, he changes to a person capable of caring about and loving someone other than himself.\n\nVegeta was once a young member of the Saiyan army, but after his race's demise, he worked alongside Nappa and Raditz, directly under Freeza. He seeks immortality to rule the universe, but once he learns about Freeza destroying his planet from Dodoria, he resolves to take out Freeza (not to avenge his race, but to assure his own rule over the universe as well as to get back at Freeza for unknowingly using him to further his own goals). He later battles Freeza with the main cast on Namek and dies in the ensuing fights; once he is revived, he returns to Earth, where he adjusts to everyday life and remains there for good.\n\nIn Cross Epoch (the Dragon Ball and One Piece crossover one-shot) Vegeta is the captain of an air ship and is seen wearing an eye patch and a cape with a clasp featuring the Kanji character for \"vegetable.\" Trunks, Usopp and Nico Robin are members of his crew.\n\n(Source: Dragon Ball Super Exciting Guide, Character Edition)"
    },
    {
    "mal_id": 89,
    "url": "https://myanimelist.net/character/89/Shinji_Ikari",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/225177.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/5/225177.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/5/225177t.webp"
    }
    },
    "name": "Shinji Ikari",
    "name_kanji": "碇 シンジ",
    "nicknames": [
    "Third Child"
    ],
    "favorites": 18103,
    "about": "Age: 14\nBirthday: June 6, 2001\nHeight: 155 cm (5'1\")\nBlood type: A\nFather: Gendo Ikari\nMother: Yui Ikari\nGuardian: Misato Katsuragi\n\nShinji Ikari is the Third Child (\"Third Children\" in Japanese), who pilots Unit 01. He is the son of Gendo and the late Yui Ikari. Abandoned by his father, Gendo, when he was a toddler, Shinji often ran away from difficult situations. As a pilot, he panics easily and reacts very poorly to unexpected events. Over time and with encouragement from Misato, he learns to be less cowardly, more outspoken, and more confident.\n\n\n\n(Source: Afufu)"
    },
    {
    "mal_id": 86,
    "url": "https://myanimelist.net/character/86/Rei_Ayanami",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/314932.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/314932.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/11/314932t.webp"
    }
    },
    "name": "Rei Ayanami",
    "name_kanji": "綾波 レイ",
    "nicknames": [
    "First Child"
    ],
    "favorites": 18001,
    "about": "Age: 14\nBirthday: 2001\nHeight: 4' 11\" / 149 cm\nSex: Female\nGuardian: Gendou Ikari\n\nRei Ayanami is the \"First Children\" of the Marduk Report and the pilot of EVA-00. Shrouded in mystery, she is socially withdrawn and rarely shows emotion. Seemingly completely devoted to her duty as an EVA pilot, her only apparent human relationship being with Nerv commander Gendou Ikari.\n\nHowever, Rei comes to know Shinji Ikari and after some initial mistrust they come to better understand each other, revealing more of Rei`s emotional side and helping Shinji trust others again."
    },
    {
    "mal_id": 64769,
    "url": "https://myanimelist.net/character/64769/Shouyou_Hinata",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/243919.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/11/243919.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/11/243919t.webp"
    }
    },
    "name": "Shouyou Hinata",
    "name_kanji": "日向 翔陽",
    "nicknames": [
    "Shou-chan",
    "Shorty",
    "Strongest Decoy",
    "Shrimp"
    ],
    "favorites": 17982,
    "about": "Team: Karasuno High, Yukigaoka Junior High (former)\nAge: 16\nBirthday: June 21, 1996\nHeight: 162.8cm (5' 4.1\") - Apr 2012\n164.2cm (5' 4.6\") - Nov 2012\nWeight: 51.9 kg\nYear: 1st Year, class 1\nNumber: 10\nPosition: Middle Blocker\nFavorite Food: Tamago kake gohan (a meal composed of a raw egg mixed with white rice, often seasoned with soy sauce)\nCurrent Concerns: Being unable to hold the ball in one hand\nAbility Parameters (out of 5): Power = 1; jump = 5; stamina = 5; intellect = 1; technique = 1; speed = 5\n\nHinata has an unusually high ability to jump. Since he was young, Hinata trained his legs to compensate for his lack of height. He joins Karusuno High School Volleyball team and amazes the team with his natural affinity as a spiker. Although he is a complete beginner and never had any experience playing in a volleyball team, he grows rapidly through each match.\n\nHinata has a cheerful and energetic personality. He's a natural schmoozer and his teammates would sometimes use him to win someone over, such as Nishinoya. Hinata gets excited easily and often talks loudly. He is the loudest member after Nishinoya and Tanaka. He is friendly and can befriend anyone easily, such as Kenma from Nekoma High and Aone from Date Tech High.\n\nDespite his easy-going personality, Hinata is extremely competitive, especially when it comes to volleyball. As stated by Sugawara, Hinata has a very big fortitude to win and thus, doesn't give up easily during a match no matter if it's a practice match or a real match. Hinata can also exhibit a very scary and intimidating face when people underestimate him. Despite that, Hinata gets scared easily, especially by larger and stronger opponents. However, he recovers quickly and will then confidently challenge the opponents.\n\n(Source: Haikyuu!! Wikia)"
    },
    {
    "mal_id": 71121,
    "url": "https://myanimelist.net/character/71121/Hange_Zoë",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/15/208637.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/15/208637.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/15/208637t.webp"
    }
    },
    "name": "Hange Zoë",
    "name_kanji": "ハンジ・ゾエ",
    "nicknames": [],
    "favorites": 17806,
    "about": "Age: Unknown\nGender: Ambiguous \nBirthday: September 5\nHeight: 170 cm (5'7\")\nWeight: 60 kg (132 lbs)\nAffiliations: Scouting Legion\n\nScouting Legion's Squad Leader.\n\nHange is very passionate and driven in pursuit of new knowledge. They can be seen as very hyperactive, often diving into projects without thought for personal safety (and frightening lots of subordinates in the process), instead preoccupied with observing and documenting the subjects. Some misunderstand these acts and Hange is seen as eccentric and having more than a few screws loose. They also enjoy discussing this research, but as the lectures can be very long and detail-oriented, not many fellow soldiers find them interesting.\n\nHange is often excited by Titans and is always eager to experiment with them, coming off as extremely emotional regarding titans. For example, they cry at the amount of pain being caused to a Titan during experimentation."
    },
    {
    "mal_id": 118735,
    "url": "https://myanimelist.net/character/118735/Subaru_Natsuki",
    "images": {
    "jpg": {
    "image_url": "https://cdn.myanimelist.net/images/characters/15/315153.jpg"
    },
    "webp": {
    "image_url": "https://cdn.myanimelist.net/images/characters/15/315153.webp",
    "small_image_url": "https://cdn.myanimelist.net/images/characters/15/315153t.webp"
    }
    },
    "name": "Subaru Natsuki",
    "name_kanji": "ナツキ・スバル",
    "nicknames": [
    "Barusu"
    ],
    "favorites": 17708,
    "about": "Age: 17→18\nBirthday: April 1\nHeight: 173 cm (5'8\")\n\nOn the way home from the convenience store, he suddenly finds himself transported into another world. He has the ability that he calls \"Return by Death\" to go back in time when he dies, with only himself being aware of the reversal of time. Despite being a hikikomori and gamer in his real world, Subaru does a bit of workout and seems to know basic hand-to-hand combat, making him not completely weak.\n\nWhile Subaru tends to not read the situation, he is loyal to those he holds dear, willing to help them, even if that means taking the thorny path. He has his resolve confirmed through the many situations and circumstances he faces in the fantasy world, originally having been one to always take the \"easy\" route. As a hikikomori, he is hopeful of the possibilities that being sucked into a new realm brings, but later realizes the realities of the predicament he is in. Ultimately, he resolves himself to be faithful and protective of the ones that he cares most about.\n\n(Source: Re:Zero Wiki)"
    }
    ]